Repository: openstack/aodh
Catalog: aodh/locale/*/LC_MESSAGES/aodh.po
Languages: pt, ru

source: %(name)s count exceeds maximum value %(maximum)d
pt: a contagem %(name)s excede o valor máximo %(maximum)d
ru: контент %(name)s превышает количество символов в %(maximum)d

source: %(rule)s must be set for %(type)s type alarm
pt: %(rule)s devem ser definidas para o tipo de aviso %(type)s
ru: %(rule)s должны быть установлены для %(type)s сигналов тревоги

source: %(rule1)s and %(rule2)s cannot be set at the same time
pt: %(rule1)s e %(rule2)s não podem ser programadas ao mesmo tempo
ru: %(rule1)s и %(rule2)s не могут работать одновременно

source: %d datapoints are unknown
pt: endereços de grupo %d desconhecidos
ru: %d исходный код данных не известен

source: Alarm %(alarm_id)s not found in project %(project)s
pt: Alarme %(alarm_id)s não encontrado no projeto %(project)s
ru: Сигнал %(alarm_id)s не найдены в проекте %(project)s

source: Alarm %s not found
pt: Alarme %s não encontrado
ru: Сигнал %s не найден

source: Alarm combination rule should contain at least two different alarm ids.
pt: A regra de combinação de avisos deve conter pelo menos duas ids de alarme diferentes.
ru: сигнал тревоги должно содержать по крайней мере два различных идентификаторов сигнализации.

source: Alarm incorrect
pt: Alarme incorreto
ru: Сигнализация неисправна

source: Alarm quota exceeded for user %(u)s on project %(p)s
pt: Aviso de quota excedida para o utilizador %(u)s no projeto %(p)s
ru: количество ошибок пользователем %(u)s превысила норму %(p)s

source: Alarm when %(meter_name)s is %(comparison_operator)s a %(statistic)s of %(threshold)s over %(period)s seconds
pt: Alarme quando %(meter_name)s é %(comparison_operator)s uma %(statistic)s de %(threshold)s em %(period)s segundos
ru: При срабатываемости сигналатревоги %(meter_name)s как %(comparison_operator)s a %(statistic)s в %(threshold)s срабатывает за %(period)s секунду

source: Alarm when %s event occurred.
pt: Alarme quando evento %s ocorreu.

source: Alarms %(alarm_ids)s are in unknown state
pt: Os alarmes %(alarm_ids)s encontram-se em estado desconhecido
ru: Сигнализация %(alarm_ids)s в не корректном состоянии

source: Cannot specify alarm %s itself in combination rule
pt: Não é possivel especificar o próprio alarme %s na combinação de regras
ru: Не указывать сигнал тревоги %s в комбинации правило

source: Combined state of alarms %s
pt: Estado combinado dos avisos %s
ru: смешанное состояние тревоги %s

source: Configuration:
pt: Configuração:
ru: Конфигурация:

source: Connecting to %(db)s on %(nodelist)s
pt: Ligar a %(db)s em %(nodelist)s
ru: Подключение к %(db)s на %(nodelist)s

source: Error parsing HTTP response: %s
pt: Erro ao analisar resposta HTTP: %s
ru: Ошибка ввода HTTP кода: %s

source: Error while posting alarm: %s
pt: Erro ao postar o alarme: %s
ru: Ошибка при отправке сигнала тревоги: %s

source: Error while putting alarm: %s
pt: Erro ao pôr o alarme: %s
ru: Ошибка во время установки тревоги: %s

source: Failed to evaluate alarm %s
pt: Falha ao avaliar avisos %s
ru: не удалось определить тип тревоги %s

source: Failed to parse the timestamp value %s
pt: Erro ao analisar o valor data/hora %s
ru: Не удалось разобрать значение временной метки %s

source: Filter expression not valid: %s
pt: Expressão filtro inválida: %s
ru: Фильтр ввода не действует: %s

source: Limit should be positive
pt: O limite deve ser positivo
ru: Лимит должен быть точным

source: Not Authorized to access %(aspect)s %(id)s
pt: Não Autorizado o acesso a %(aspect)s %(id)s
ru: Нет доступа к %(aspect)s %(id)s

source: Notifying alarm %(alarm_name)s %(alarm_id)s of %(severity)s priority from %(previous)s to %(current)s with action %(action)s because %(reason)s.
pt: Notificar alarme %(alarm_name)s %(alarm_id)s de %(severity)s prioridade de %(previous)s a %(current)s com a ação %(action)s devido a %(reason)s.
ru: Сигнал тревоги %(alarm_name)s %(alarm_id)s не работает потому что %(reason)s в %(severity)s приоритетом на %(previous)s %(current)s влияние на действие %(action)s

source: Order-by expression not valid: %s
pt: Expressão ordenar por inválida: %s
ru: вызов значения не активна: %s

source: Remaining as %(state)s due to %(count)d samples %(disposition)s threshold, most recent: %(most_recent)s
pt: Mantendo-se como %(state)s devido a %(count)d amostras %(disposition)s no limite, mais recentes: %(most_recent)s
ru: в последнее время %(most_recent)s оставаясь %(state)s у порога из-за %(count)d испытательных сигналов %(disposition)s

source: Remaining as %(state)s due to alarms %(alarm_ids)s in state %(state)s
pt: Mantendo-se em %(state)s devido aos alarmes %(alarm_ids)s em estado %(state)s
ru: Оставаясь %(state)s в состоянии уведомления %(state)s из-за тревоги %(alarm_ids)s

source: Starting server in PID %s
pt: Iniciar servidor em PID %s
ru: сервер начинается с PID %s

source: String %s is not a valid isotime
pt: A string %s não é um tempo ISO válido
ru: Строка %s временно не активна

source: The data type %(type)s is not supported. The supported data type list is: %(supported)s
pt: O tipo de dados %(type)s não é suportado. A lista do tipo de dados suportados é: %(supported)s
ru: Тип данных %(type)s не поддерживается. Список поддерживаемых типов данных: %(supported)s

source: Time constraint names must be unique for a given alarm.
pt: Os nomes das restrições de tempo deve ser únicos para um determinado aviso.
ru: Название временного контента должна отличаться для сигнала превоги

source: Timezone %s is not valid
pt: Fuso horário %s inválido
ru: таймер %s не актевирован

source: Transition to %(state)s due to %(count)d samples %(disposition)s threshold, most recent: %(most_recent)s
pt: Transição para %(state)s devido a %(count)d amostras %(disposition)s no limite, mais recentes: %(most_recent)s
ru: последнее время %(most_recent)s, переход в состояния оповещения %(state)s из-за %(count)d попыток испытания%(disposition)s у порога

source: Transition to %(state)s due to alarms %(alarm_ids)s in state %(state)s
pt: Transição para %(state)s devido aos alarmes %(alarm_ids)s em estado %(state)s
ru: Переход %(state)s из состояния тревоги %(alarm_ids)s в положение %(state)s

source: Unable to connect to the database server: %(errmsg)s.
pt: Não é possível ligar ao servidor da base de dados: %(errmsg)s.
ru: Не удается подключиться к серверу базы данных: %(errmsg)s.

source: Unable to convert the value %(value)s to the expected data type %(type)s.
pt: Incapaz de converter o valor %(value)s para o tipo de dados esperados %(type)s.
ru: Невозможно преобразовать значение %(value)s с ожидаемым типом данных %(type)s.

source: Unable to parse action %s
pt: Incapaz de analisar a ação %s
ru: Невозможно разобрать действий %s

source: Unexpected exception converting %(value)s to the expected data type %(type)s.
pt: Exceção inesperada ao converter %(value)s para o tipo de dados esperado %(type)s.
ru: мгновенное преобразования значения %(value)s с ожидаемым типом данных %(type)s.

source: Unsupported action %s
pt: Ação não suportada %s
ru: не поддерживается действие %s

source: You are not authorized to create action: %s
pt: Não tem permissão para criar a ação: %s
ru: Вы не авторизованы, чтобы деиствовать: %s

source: alarm %(id)s transitioning to %(state)s because %(reason)s
pt: alarme %(id)s a passar a %(state)s devido a %(reason)s
ru: Сигнализация %(id)s приводится в действие %(state)s потому что %(reason)s

source: alarm evaluation cycle failed
pt: o ciclo de avaliação do alarme falhou
ru: Оценка цикла тревог не удался

source: alarm state update failed
pt: a atualização do estado do alarme falhou
ru: сигнал тревоги определить не удалось

source: alarm stats retrieval failed
pt: a extração da estatística do alarme falhou
ru: Статистика сигнал оповещения не получен

source: duplicate actions are found: %s, remove duplicate ones
pt: encontradas ações duplicadas: %s, remover as duplicadas
ru: дублирующие действия найдены в: %s, удалить дубликаты из них

source: initiating evaluation cycle on %d alarms
pt: iniciando ciclo de avaliação em alarme %d
ru: приступим к оценке цикла %d alarms

source: serving on 0.0.0.0:%(sport)s, view at http://127.0.0.1:%(vport)s
pt: ativo em 0.0.0.0:%(sport)s, ver em http://127.0.0.1:%(vport)s
ru: услуга на 0.0.0.0:%(sport)s, указывает на http://127.0.0.1:%(vport)s

source: serving on http://%(host)s:%(port)s
pt: ativo em http://%(host)s:%(port)s
ru: указатели на http://%(host)s:%(port)s

source: state invalid
pt: estato inválido
ru: Неправильное состояние

source: state_timestamp should be datetime object
pt: state_timestamp deve ser um objeto data/hora
ru: В state_timestamp должен быть указан дата объекта

source: timestamp should be datetime object
pt: o timestamp deve ser um objeto data/hora
ru: должна быть указана дата вывода объекта

source: %s is not JSON serializable
ru: %s не является сериализуемым с помощью JSON
